# Contents:

Pandas:
1. Intro
2. Pandas Series
3. Pandas Dataframe
4. Indexing and Slicing DataFrames
5. Data Manipulation
9. Input/Output Operations

## 1. Intro

### 1.1. Installation

In [4]:
pip install pandas

Requirement already satisfied: pandas in c:\users\salma\anaconda3\envs\ailab\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\salma\anaconda3\envs\ailab\lib\site-packages (from pandas) (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\salma\anaconda3\envs\ailab\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\salma\anaconda3\envs\ailab\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\salma\anaconda3\envs\ailab\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\salma\anaconda3\envs\ailab\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

### 1.2. Importing

In [5]:
import pandas as pd

## 2. Pandas Series
A Series is a one-dimensional labeled array capable of holding any data type. It can be created from a list, NumPy array, or dictionary.

### 2.1. Creating a Series

In [6]:
import pandas as pd

# From a list
s = pd.Series([10, 20, 30, 40])
print(s)

# From a dictionary
s_dict = pd.Series({'a': 10, 'b': 20, 'c': 30})
print(s_dict)

print(type(s))

0    10
1    20
2    30
3    40
dtype: int64
a    10
b    20
c    30
dtype: int64
<class 'pandas.core.series.Series'>

## 3. Pandas DataFrame
A DataFrame is a two-dimensional labeled data structure with columns of potentially different types, similar to a spreadsheet.

### 3.1. Creating a DataFrame

In [7]:
# From a dictionary of lists
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'Salary': [50000, 60000, 70000]}
df = pd.DataFrame(data)
print(df,"\n")

# From a list of lists
data = [['Alice', 25, 50000], ['Bob', 30, 60000], ['Charlie', 35, 70000]]
df = pd.DataFrame(data, columns=['Name', 'Age', 'Salary'])
print(df)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

## 4. Indexing and Slicing DataFrames
You can access specific rows and columns in a DataFrame using various methods like .loc[], .iloc[], or direct indexing.

### 4.1. Accessing columns

In [8]:
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

In [9]:
# Set the index to the 'name' column
df = df.set_index('Name')
df

         Age  Salary
Name
Alice     25   50000
Bob       30   60000
Charlie   35   70000

In [10]:
print(df['Salary'])  # Access 'Name' column

Name
Alice      50000
Bob        60000
Charlie    70000
Name: Salary, dtype: int64

### 4.2. Accessing rows

In [11]:
print(df.loc["Alice"],"\n")  # Access row with label Alice
print(df.iloc[2])  # Access row by position 1

Age          25
Salary    50000
Name: Alice, dtype: int64

Age          35
Salary    70000
Name: Charlie, dtype: int64

### 4.3. Accessing specific elements

In [12]:
print(df.loc["Alice", 'Salary'])  # Access value in row "Alice", 'Salary' column

50000

Print the salary of 3rd row using row position == 1 by using iloc

## 5. Data Manipulation

### 5.1. Filtering Rows

In [13]:
df

         Age  Salary
Name
Alice     25   50000
Bob       30   60000
Charlie   35   70000

In [14]:
# Filter rows where Age > 25
df_filtered = df[df['Age'] > 25]
print(df_filtered)

         Age  Salary
Name
Bob       30   60000
Charlie   35   70000

### 5.2. Add a new column

In [15]:
df['Experience'] = [2, 5, 7]
print(df)

         Age  Salary  Experience
Name
Alice     25   50000           2
Bob       30   60000           5
Charlie   35   70000           7

### 5.3. Remove a column

In [16]:
df = df.drop('Experience', axis=1)
print(df)

         Age  Salary
Name
Alice     25   50000
Bob       30   60000
Charlie   35   70000

### 5.4. Rename columns

In [17]:
df = df.rename(columns={'Salary': 'Employee Salary', 'Age': 'Employee Age'})
print(df)

         Employee Age  Employee Salary
Name
Alice              25            50000
Bob                30            60000
Charlie            35            70000

### 5.5. Sort by a column

In [18]:
df_sorted = df.sort_values(by='Employee Salary', ascending=False) # descending
print(df_sorted)

         Employee Age  Employee Salary
Name
Charlie            35            70000
Bob                30            60000
Alice              25            50000

In [19]:
df1 = pd.DataFrame({'Name': ['Alice', 'Bob'], 'Age': [25, 30]})
df2 = pd.DataFrame({'Name': ['Alice', 'Bob'], 'Salary': [50000, 60000]})
print(df1,"\n")
print(df2)

    Name  Age
0  Alice   25
1    Bob   30

    Name  Salary
0  Alice   50000
1    Bob   60000

### 8.2. Concatenating DataFrames

In [20]:
df_concat = pd.concat([df1, df2], axis=1)
print(df_concat)

    Name  Age   Name  Salary
0  Alice   25  Alice   50000
1    Bob   30    Bob   60000

## 9. Input/Output Operations
Pandas can read from and write to various file formats such as CSV, Excel, JSON, and more.

### 9.1. Reading from CSV

In [21]:
df_csv = pd.read_csv('iris.csv')
print(df_csv)

     sepal length  sepal width  petal length  petal width           class
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

### 9.2. Writing to CSV

In [22]:
df

         Employee Age  Employee Salary
Name
Alice              25            50000
Bob                30            60000
Charlie            35            70000

In [23]:
df.to_csv('output.csv', index=True)

## 10. Some Important Functions

In [24]:
# Load dataset
df = pd.read_csv('iris.csv')

# Display first 5 rows
print(df.head())

   sepal length  sepal width  petal length  petal width        class
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [26]:
print(df.tail(7)) # last five rows

     sepal length  sepal width  petal length  petal width           class
143           6.8          3.2           5.9          2.3  Iris-virginica
144           6.7          3.3           5.7          2.5  Iris-virginica
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

In [27]:
# Basic statistics
print(df.describe())

       sepal length  sepal width  petal length  petal width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [28]:
# Filter by condition
df_filtered = df[df['sepal length'] > 5.0]
print(df_filtered)

     sepal length  sepal width  petal length  petal width           class
0             5.1          3.5           1.4          0.2     Iris-setosa
5             5.4          3.9           1.7          0.4     Iris-setosa
10            5.4          3.7           1.5          0.2     Iris-setosa
14            5.8          4.0           1.2          0.2     Iris-setosa
15            5.7          4.4           1.5          0.4     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[118 rows x 5 columns]

# Excercise

### Task 1
Load homelessness dataframe from homelessness.csv. 
Print head(), tail(), info(), shape, describe(). You can make as many cells as you want

In [30]:
homelessness = pd.read_csv("homelessness.csv",index_col=0)
homelessness.head()

               region       state  individuals  family_members  state_pop
0  East South Central     Alabama       2570.0           864.0    4887681
1             Pacific      Alaska       1434.0           582.0     735139
2            Mountain     Arizona       7259.0          2606.0    7158024
3  West South Central    Arkansas       2280.0           432.0    3009733
4             Pacific  California     109008.0         20964.0   39461588

### Task 2
Print a 2D NumPy array of the values in homelessness by using (homelessness.values)
Print the column names of homelessness by using (homelessness.columns)
Print the index of homelessness (homelessness.index)

### Task 3
Sort homelessness by the number of homeless individuals in the individuals column, from smallest to largest, and save this as homelessness_ind.
Print the head of the sorted DataFrame.

### Task 4
Sort homelessness by the number of homeless family_members in descending order, and print the head

### Sorting by multiple columns
In cases where rows have the same value (this is common if you sort on a categorical variable), you may wish to break the ties by sorting on another column. You can sort on multiple columns in this way by passing a list of column names.

### Example
Sort homelessness first by region (ascending), and then by number of family members (descending). Save this as homelessness_reg_fam.

In [31]:
# Sort homelessness by region, then descending family members
homelessness_reg_fam = homelessness.sort_values(["region","family_members"],ascending = [True,False])

# Print the top few rows
print(homelessness_reg_fam.head())

                region      state  individuals  family_members  state_pop
13  East North Central   Illinois       6752.0          3891.0   12723071
35  East North Central       Ohio       6929.0          3320.0   11676341
22  East North Central   Michigan       5209.0          3142.0    9984072
49  East North Central  Wisconsin       2740.0          2167.0    5807406
14  East North Central    Indiana       3776.0          1482.0    6695497

### Task 5
Create a Series called individuals that contains only the individuals column of homelessness. Print the head only.

### Task 6
Create a DataFrame called state_fam that contains only the state and family_members columns of homelessness, in that order. Print the head only.

### Task 7
Filter homelessness for cases where the number of individuals is greater than ten thousand, assigning to ind_gt_10k. View the printed result.

### Task 8
Filter homelessness for cases where the USA Census region is "Mountain", assigning to mountain_reg. View the printed result.

### Task 9
Filter homelessness for cases where the number of family_members is less than one thousand and the region is "Pacific", assigning to fam_lt_1k_pac. View the printed result.

### Task 10
Add a new column to homelessness, named total, containing the sum of the individuals and family_members columns.

### Task 11
Add another column to homelessness, named p_homeless, containing the proportion of the total homeless population to the total population in each state state_pop.

### Task 12
* Subset rows where indiv_per_10k is higher than 20, assigning to high_homelessness.
* Sort high_homelessness by descending indiv_per_10k, assigning to high_homelessness_srt.
* Select only the state and indiv_per_10k columns of high_homelessness_srt and save as result. Look at the result.

# Slicing and Indexing Data frames

Setting and removing indexes
pandas allows you to designate columns as an index. This enables cleaner code when taking subsets (as well as providing more efficient lookup under some circumstances).

In this chapter, you'll be exploring temperatures, a DataFrame of average temperatures in cities around the world

In [34]:
temperatures = pd.read_csv('temperatures.csv',index_col=False)
temperatures = temperatures.drop(columns=['Unnamed: 0'])
temperatures.head()

         date     city        country  avg_temp_c
0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4  2000-05-01  Abidjan  Côte D'Ivoire      27.547

* Look at temperatures.
* Set the index of temperatures to "city", assigning to temperatures_ind.
* Look at temperatures_ind. How is it different from temperatures?
* Reset the index of temperatures_ind, keeping its contents.
* Reset the index of temperatures_ind, dropping its contents.

In [35]:
# Look at temperatures
print(temperatures)

             date     city        country  avg_temp_c
0      2000-01-01  Abidjan  Côte D'Ivoire      27.293
1      2000-02-01  Abidjan  Côte D'Ivoire      27.685
2      2000-03-01  Abidjan  Côte D'Ivoire      29.061
3      2000-04-01  Abidjan  Côte D'Ivoire      28.162
4      2000-05-01  Abidjan  Côte D'Ivoire      27.547
...           ...      ...            ...         ...
16495  2013-05-01     Xian          China      18.979
16496  2013-06-01     Xian          China      23.522
16497  2013-07-01     Xian          China      25.251
16498  2013-08-01     Xian          China      24.528
16499  2013-09-01     Xian          China         NaN

[16500 rows x 4 columns]

In [36]:
# Set the index of temperatures to city
temperatures_ind = temperatures.set_index("city")

# Look at temperatures_ind
print(temperatures_ind)

               date        country  avg_temp_c
city
Abidjan  2000-01-01  Côte D'Ivoire      27.293
Abidjan  2000-02-01  Côte D'Ivoire      27.685
Abidjan  2000-03-01  Côte D'Ivoire      29.061
Abidjan  2000-04-01  Côte D'Ivoire      28.162
Abidjan  2000-05-01  Côte D'Ivoire      27.547
...             ...            ...         ...
Xian     2013-05-01          China      18.979
Xian     2013-06-01          China      23.522
Xian     2013-07-01          China      25.251
Xian     2013-08-01          China      24.528
Xian     2013-09-01          China         NaN

[16500 rows x 3 columns]

In [37]:
# Reset the temperatures_ind index, keeping its contents
print(temperatures_ind.reset_index("city"))

          city        date        country  avg_temp_c
0      Abidjan  2000-01-01  Côte D'Ivoire      27.293
1      Abidjan  2000-02-01  Côte D'Ivoire      27.685
2      Abidjan  2000-03-01  Côte D'Ivoire      29.061
3      Abidjan  2000-04-01  Côte D'Ivoire      28.162
4      Abidjan  2000-05-01  Côte D'Ivoire      27.547
...        ...         ...            ...         ...
16495     Xian  2013-05-01          China      18.979
16496     Xian  2013-06-01          China      23.522
16497     Xian  2013-07-01          China      25.251
16498     Xian  2013-08-01          China      24.528
16499     Xian  2013-09-01          China         NaN

[16500 rows x 4 columns]

In [38]:
# Reset the temperatures_ind index, dropping its contents
print(temperatures_ind.reset_index(drop=True))

             date        country  avg_temp_c
0      2000-01-01  Côte D'Ivoire      27.293
1      2000-02-01  Côte D'Ivoire      27.685
2      2000-03-01  Côte D'Ivoire      29.061
3      2000-04-01  Côte D'Ivoire      28.162
4      2000-05-01  Côte D'Ivoire      27.547
...           ...            ...         ...
16495  2013-05-01          China      18.979
16496  2013-06-01          China      23.522
16497  2013-07-01          China      25.251
16498  2013-08-01          China      24.528
16499  2013-09-01          China         NaN

[16500 rows x 3 columns]

### Task 13
Given a list called cities that contains "Moscow" and "Saint Petersburg".
Use [] subsetting to filter temperatures for rows where the city column takes a value in the cities list.

In [ ]:
cities = ["Moscow", "Saint Petersburg"]
# write code below

### Subsetting with .loc[]
The killer feature for indexes is .loc[]: a subsetting method that accepts index values. When you pass it a single argument, it will take a subset of rows.

The code for subsetting using .loc[] can be easier to read than standard square bracket subsetting, which can make your code less burdensome to maintain.

### Task 14 (solved)
Use .loc[] subsetting to filter temperatures_ind for rows where the city is in the cities list.

In [ ]:
# Subset temperatures_ind using .loc[]
print(temperatures_ind.loc[cities])

### Task 15 (solved)
* Use Boolean conditions, not .isin() or .loc[], and the full date "yyyy-mm-dd", to subset temperatures for rows where the date column is in 2010 and 2011 and print the results.
* Set the index of temperatures to the date column and sort it.
* Use .loc[] to subset temperatures_ind for rows in 2010 and 2011.
* Use .loc[] to subset temperatures_ind for rows from August 2010 to February 2011.

In [39]:
# Use Boolean conditions to subset temperatures for rows in 2010 and 2011
temperatures_bool = temperatures[(temperatures["date"] >= "2010-01-01") & (temperatures["date"] <= "2011-12-31")]
print(temperatures_bool)

# Set date as the index and sort the index
temperatures_ind = temperatures.set_index("date").sort_index()
print(temperatures_ind)

# Use .loc[] to subset temperatures_ind for rows in 2010 and 2011
print(temperatures_ind.loc["2010":"2011"])

# Use .loc[] to subset temperatures_ind for rows from Aug 2010 to Feb 2011
print(temperatures_ind.loc["2010-08":"2011-02"])

             date     city        country  avg_temp_c
120    2010-01-01  Abidjan  Côte D'Ivoire      28.270
121    2010-02-01  Abidjan  Côte D'Ivoire      29.262
122    2010-03-01  Abidjan  Côte D'Ivoire      29.596
123    2010-04-01  Abidjan  Côte D'Ivoire      29.068
124    2010-05-01  Abidjan  Côte D'Ivoire      28.258
...           ...      ...            ...         ...
16474  2011-08-01     Xian          China      23.069
16475  2011-09-01     Xian          China      16.775
16476  2011-10-01     Xian          China      12.587
16477  2011-11-01     Xian          China       7.543
16478  2011-12-01     Xian          China      -0.490

[2400 rows x 4 columns]
                 city        country  avg_temp_c
date
2000-01-01    Abidjan  Côte D'Ivoire      27.293
2000-01-01     Lahore       Pakistan      12.792
2000-01-01   Tangshan          China      -5.406
2000-01-01      Gizeh          Egypt      12.669
2000-01-01    Lakhnau          India      15.152
...               ...            ...         ...
2013-09-01    Nanjing          China         NaN
2013-09-01  New Delhi          India         NaN
2013-09-01   New York  United States      17.408
2013-09-01     Peking          China         NaN
2013-09-01       Xian          China         NaN

[16500 rows x 3 columns]
                  city    country  avg_temp_c
date
2010-01-01  Faisalabad   Pakistan      11.810
2010-01-01   Melbourne  Australia      20.016
2010-01-01   Chongqing      China       7.921
2010-01-01   São Paulo     Brazil      23.738
2010-01-01   Guangzhou      China      14.136
...                ...        ...         ...
2010-12-01     Jakarta  Indonesia      26.602
2010-12-01       Gizeh      Egypt      16.530
2010-12-01      Nagpur      India      19.120
2010-12-01      Sydney  Australia      19.559
2010-12-01    Salvador     Brazil      26.265

[1200 rows x 3 columns]
                     city        country  avg_temp_c
date
2010-08-01       Calcutta          India      30.226
2010-08-01           Pune          India      24.941
2010-08-01          Izmir         Turkey      28.352
2010-08-01        Tianjin          China      25.543
2010-08-01         Manila    Philippines      27.101
...                   ...            ...         ...
2011-01-01  Dar Es Salaam       Tanzania      28.541
2011-01-01        Nairobi          Kenya      17.768
2011-01-01    Addis Abeba       Ethiopia      17.708
2011-01-01        Nanjing          China       0.144
2011-01-01       New York  United States      -4.463

[600 rows x 3 columns]

In [40]:
import pandas as pd

# Creating a sample DataFrame
data = {
    'city': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Philadelphia', 'San Antonio', 'San Diego', 'Dallas', 'San Jose'],
    'country': ['USA', 'USA', 'USA', 'USA', 'USA', 'USA', 'USA', 'USA', 'USA', 'USA'],
    'avg_temp_c': [12.3, 18.7, 11.2, 21.3, 23.0, 13.1, 20.8, 18.9, 22.5, 15.5],
    'population_million': [8.4, 3.9, 2.7, 2.3, 1.7, 1.6, 1.5, 1.4, 1.3, 1.0],
    'gdp_per_capita_usd': [84200, 85000, 65200, 70600, 69000, 61000, 58000, 59000, 60200, 62500]
}

temperatures = pd.DataFrame(data)

# Displaying the DataFrame
print(temperatures)

           city country  avg_temp_c  population_million  gdp_per_capita_usd
0      New York     USA        12.3                 8.4               84200
1   Los Angeles     USA        18.7                 3.9               85000
2       Chicago     USA        11.2                 2.7               65200
3       Houston     USA        21.3                 2.3               70600
4       Phoenix     USA        23.0                 1.7               69000
5  Philadelphia     USA        13.1                 1.6               61000
6   San Antonio     USA        20.8                 1.5               58000
7     San Diego     USA        18.9                 1.4               59000
8        Dallas     USA        22.5                 1.3               60200
9      San Jose     USA        15.5                 1.0               62500

### Task 16 (using iloc)
* Get the 23rd row, 2nd column (index 22, 1):
* Use slicing to get the first 5 rows:
* Use slicing to get columns 3 to 4:
* Get the first 5 rows, and columns 3 to 4

### Task 17 (using loc) 
***.loc is used for label-based indexing.***
* Select row where city is 'Chicago'
* Select only 'city' and 'avg_temp_c' columns
* Get the first 5 rows and only 'city' and 'population_million' columns

In [41]:
import pandas as pd
import numpy as np

# Creating a sample DataFrame with null values
data = {
    'city': ['New York', 'Los Angeles', np.nan, 'Houston', 'Phoenix', 'Philadelphia', 'San Antonio', np.nan, 'Dallas', 'San Jose'],
    'avg_temp_c': [12.3, 18.7, np.nan, 21.3, 23.0, 13.1, 20.8, 18.9, np.nan, 15.5],
    'population_million': [8.4, 3.9, 2.7, np.nan, 1.7, 1.6, 1.5, 1.4, 1.3, np.nan],
    'gdp_per_capita_usd': [84200, 85000, np.nan, 70600, 69000, np.nan, 58000, 59000, np.nan, 62500]
}

temperatures = pd.DataFrame(data)

# Displaying the DataFrame
print(temperatures)

           city  avg_temp_c  population_million  gdp_per_capita_usd
0      New York        12.3                 8.4             84200.0
1   Los Angeles        18.7                 3.9             85000.0
2           NaN         NaN                 2.7                 NaN
3       Houston        21.3                 NaN             70600.0
4       Phoenix        23.0                 1.7             69000.0
5  Philadelphia        13.1                 1.6                 NaN
6   San Antonio        20.8                 1.5             58000.0
7           NaN        18.9                 1.4             59000.0
8        Dallas         NaN                 1.3                 NaN
9      San Jose        15.5                 NaN             62500.0

### Task 18
Save the DataFrame (temperatures) as a CSV file using the pandas to_csv() method. Name the file ('task31.csv')

### Task 19
You will be using the pandas and numpy library for the tasks below. The dataset (.csv) is attached with the task.
#### 1.	Import the libraries numpy and pandas.
#### 2.	Upload car_prices.csv (use pd.read_csv(file_path) to read this file)
#### 3.	Display the last 5 rows
#### 4.	Display the following columns with last 5 rows 
#### •	body, 
#### •	state, 
#### •	interior, 
#### •	seller
#### 5.	How many models of vehicle are there in record?
#### 6.	Print the name of all the columns present in your dataset
#### 7.	Enlist all vehicles that are made after 2015?
#### 8.	Compute and print the total selling price of all the vehicles in the dataset.
#### 9.	Which is the most expensive vehicle in the dataset?
#### 10.	 Which make is the most popular?

<h2 style="color:red;text-align: center;">Bas ya or???</h2>